---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencySketchError
source: html/3e21b30a-9af7-6171-5e0a-695c597f9e66.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencySketchError Property

There is a circular chain of references among the highlighted elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircularDependencySketchError { get; }
```